# vim:ft=ruby:
#

tap "facebook/fb"
tap "derailed/k9s"
tap "github/gh"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "osx-cross/avr"
tap "px4/px4"
tap "teamookla/speedtest"
tap "achannarasappa/tap"
tap "ankitpokhrel/jira-cli"
tap "jaxxstorm/tap"
tap "hashicorp/tap"
tap "cargo-lambda/cargo-lambda"

# brew "asdf" # moved to zinit

brew "act"
brew "actionlint"
brew "ansifilter"
brew "autoconf"
brew "automake"
brew "aws-sso-creds"
brew "bat"
brew "black"
brew "cargo-lambda"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "libpq"
brew "openssl@1.1"
brew "readline"
brew "unixodbc"
brew "autoenv"
brew "direnv"
brew "avrdude"
brew "clipper", restart_service: true
brew "speedtest", force: true
brew "cmatrix"
brew "colordiff"
brew "curl"
brew "cloc"
brew "dfu-programmer"
brew "dfu-util"
brew "glow"
brew "gpg"
brew "gpg2"
brew "doctl"
brew "eza"
brew "emacs"
brew "fd"
brew "ffmpeg"
brew "forego"
brew "fzf"
brew "fzf-tab"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "glide"
brew "go-jira"
brew "helm"
brew "hub"
brew "hugo"
brew "jira-cli"
brew "jless"
brew "jq"
brew "k3d"
brew "kubernetes-cli"
brew "libxslt"
brew "markdown"
brew "mas"
brew "minikube"
brew "neovim"
brew "noti"
brew "openssh"
brew "packer"
brew "pre-commit"
brew "pure"
brew "python"
brew "rcm"
brew "rename"
brew "ripgrep"
brew "rga"
brew "rke"
brew "sesh"
brew "ssh-copy-id"
brew "starship"
brew "streamlink"
brew "svn"
brew "terraform"
brew "terraform-docs"
brew "the_silver_searcher"
brew "ticker"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "unzip"
brew "vault"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zinit"
brew "derailed/k9s/k9s"
brew "goreleaser/tap/goreleaser"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "px4/px4/gcc-arm-none-eabi"
brew 'tree'
brew 'atomicparsley'
brew 'sst/tap/opencode'
brew 'charmbracelet/tap/crush'
brew 'zoxide'

