# vim:ft=ruby:
#

tap 'teamookla/speedtest'
tap 'jaxxstorm/tap'
tap 'hashicorp/tap'
tap 'cargo-lambda/cargo-lambda'
tap 'neurosnap/tap'



brew 'mas'
brew 'mise'

brew 'act'
brew 'actionlint'
brew 'ansifilter'
brew 'autoconf'
brew 'automake'
brew 'aws-sso-creds'
brew 'bat'
brew 'black'
brew 'cargo-lambda'
brew 'coreutils'
brew 'libtool'
brew 'libyaml'
brew 'libpq'
brew 'openssl@1.1'
brew 'readline'
brew 'unixodbc'
brew 'autoenv'
brew 'direnv'
brew 'avrdude'
brew 'clipper', restart_service: true
brew 'teamookla/speedtest/speedtest', force: true, trusted: true
brew 'colordiff'
brew 'curl'
brew 'dfu-programmer'
brew 'dfu-util'
brew 'glow'
brew 'gpg'
brew 'gpg2'
brew 'doctl'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'fzf-tab'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'helm'
brew 'hugo'
brew 'jless'
brew 'jq'
brew 'k3d'
brew 'kubernetes-cli'
brew 'macos-trash', force: true
brew 'markdown'
brew 'minikube'
brew 'neovim'
brew 'helix'
brew 'noti'
brew 'openssh'
brew 'pre-commit'
brew 'python'
brew 'rcm'
brew 'rename'
brew 'ripgrep'
brew 'rga'
brew 'rke'
brew 'sesh'
brew 'ssh-copy-id'
brew 'pure'
brew 'starship'
brew 'streamlink'
brew 'hashicorp/tap/terraform', trusted: true
brew 'terraform-docs'
brew 'television'
brew 'tldr'
brew 'tmux'
brew 'neurosnap/tap/zmx', trusted: true
brew 'unzip'
brew 'hashicorp/tap/vault', trusted: true
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'zsh-vi-mode'
brew 'zsh-history-substring-search'
brew 'vivid'
brew 'tree'
brew 'atomicparsley'
brew 'opencode'
brew 'zoxide'
brew 'yt-dlp'
brew 'pipx'
brew 'openjdk'

# Language runtimes — managed by Homebrew (migrated off asdf).
# 'python' and 'openjdk' above are runtimes managed here too.
brew 'node'
brew 'uv'
brew 'rust' # provides cargo + rustc
brew 'go'
brew 'bun'
brew 'lua'

# yazi + optional dependencies (https://yazi-rs.github.io/docs/installation/#homebrew)
brew 'yazi'
brew 'sevenzip'
brew 'poppler'
brew 'resvg'
brew 'imagemagick'

# Language servers + formatters (helix, zed, nvim)
brew 'pyright'
brew 'ruff'
brew 'rust-analyzer'
brew 'gopls'
brew 'ruby-lsp'
brew 'typescript-language-server'
brew 'prettier'
brew 'luacheck'
brew 'stylua'

# Workflow & dev CLIs
brew 'lazygit'
brew 'zellij'
brew 'teleport'
brew 'worktrunk'
brew 'zig'

# Node-based CLIs (formerly asdf default-npm-packages, now Homebrew formulae)
brew 'vercel-cli'
brew 'npm-check-updates'
brew 'aws-cdk'
brew 'happy-coder'
brew 'cloudflare-wrangler'
brew 'pnpm'

# Language ecosystem globals (Homebrew 6.0 `brew bundle` extensions).
# Replaces asdf's default-*-packages files. `brew bundle cleanup` prunes
# anything installed globally that isn't listed here (it asks first).

# uv tools — global Python CLIs (uv tool install; needs a CLI entry point).
uv 'gflabel'

# npm globals  — e.g. npm 'some-cli' (installed via the 'node' formula above)
# cargo crates — e.g. cargo 'cargo-edit'
# go packages  — e.g. go 'github.com/jesseduffield/lazygit'
