2gua.rainbow-brackets
aaron-bond.better-comments
alefragnani.project-manager
andys8.jest-snippets
apollographql.vscode-apollo
bradlc.vscode-tailwindcss
bradymholt.pgformatter
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
ckolkman.vscode-postgres
CoenraadS.bracket-pair-colorizer
darkriszty.markdown-table-prettify
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
golang.go
GraphQL.vscode-graphql
hashicorp.terraform
JakeBecker.elixir-ls
jpoissonnier.vscode-styled-components
JuanBlanco.solidity
kamikillerto.vscode-colorize
kumar-harsh.graphql-for-vscode
leveluptutorials.react-apollo-snippets
MarkThomasMiller.sorcerer
mikestead.dotenv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-ossdata.vscode-postgresql
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vsliveshare.vsliveshare
Orta.vscode-jest
pnp.polacode
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust
stkb.rewrap
sumneko.lua
TabNine.tabnine-vscode
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wix.vscode-import-cost
XadillaX.viml
yzhang.markdown-all-in-one
